{
  "title": "Model-Based Control Design for a Composite Heater Using MATLAB/Simulink",

  "date": "June-July 2025",
  "technologies": [
    "MATLAB", 
    "Simulink", 
    "System Identification Toolbox", 
    "Simulink Coder", 
    "Embedded Coder", 
    "UART communication", 
    "C", 
    "PID control", 
    "Digital Twin Modeling"
  ],

  "overview": [
    "The goal of this project was to use the MATLAB/Simulink toolchain to perform system identification of a composite heater and design a controller using a model-based approach.",
    "The project was conducted independently within the AGH Solar Boat Student Research Group as a learning-focused exercise in model-based design and embedded deployment workflows."
  ],

  "highlights": [
    "Refactored the old embedded software I originally wrote for the composite heater, splitting it into modular files and adding UART-based data logging.",
    "Developed a MATLAB script to receive CSV-formatted data, visualize it with plots, and support system identification.",
    "Conducted a step response experiment, filtered the data, and fitted a transfer function model to represent the plant.",
    "Built a Simulink model replicating the system, integrating parts of the original C code using LCT (Legacy Code Tool), effectively creating a digital twin.",
    "Designed a PID controller in Simulink, manually tuning each component (P, I, D) to understand their individual influence on performance.",
     "Generated embedded C code from the Simulink model and verified build correctness for the target platform.",
    "Final stage includes real-world tests and comparison between the plant model and actual hardware response.",
    "Key technical challenge: fitting Simulink-generated code and legacy logic within the memory and performance limits of a small AVR microcontroller."
  ],

  "results": [
    "A validated plant model and simulation environment were created, including a digital twin with integrated legacy C code.",
    "The project successfully demonstrated a complete model-based workflow: data acquisition, system identification, controller design, and code generation.",
    "The outcome serves as a solid foundation for future closed-loop control experiments on more complex embedded systems."  
  ],

  "images": [
    {
      "src": "../images/composite_heater_object_identification/simulink_model.jpg",
      "caption": "Figure 1: Simulink model combining the plant dynamics and embedded PID controller"
    },
    {
      "src": "../images/composite_heater_object_identification/step_response_data_and_fit.png",
      "caption": "Figure 2: Raw step response data (gray) and fitted first-order transfer function response (blue)"
    },
    {
      "src": "../images/composite_heater_object_identification/object_response_to_the_control.png",
      "caption": "Figure 3: Simulation of the closed-loop system—reference temperature, control signal, and resulting object response"
    }
  ]
}