{
  "title": "Composite heater hardware, electronics, software and controller",

  "date": "December 2022 - January 2023",
  "technologies": [
    "Arduino",
    "NTC thermistors",
    "GPIO",
    "Solid State Relay (SSR)",
    "Overcurrent and residual current protection",
    "Embedded C"
  ],

  "overview": [
    "The goal was to rebuild the composite heater, reusing only the main structural parts salvaged from the old furnace after the building where it previously stood was demolished a year earlier.",
    "The project involved reconstructing the heater with new thermal insulation boards, redesigning the control and measurement systems, and building a user-friendly interface.",
    "It was carried out within the AGH Solar Boat Student Research Group, where I served as the coordinator of the electrical and electronics team."
  ],

  "highlights": [
    "Designed the measurement circuit using NTC thermistors and the control circuit with GPIO-driven transistors controlling SSRs.",
    "Was responsible for the electrical and control system design, including selection of protections (overcurrent, residual current, door interlocks).",
    "Coordinated the team in assembling the control cabinet and implementing safety logic.",
    "Designed and built the control PCB with buttons and a display for user interaction.",
    "Developed complete firmware in Arduino C to ensure rapid delivery under tight deadlines.",
    "Implemented and manually tuned a PI temperature controller.",
    "Designed a parametric setpoint generator to allow precise control of target temperature, ramp rate, and process time."
  ],

  "results": [
    "The furnace enabled manufacturing key boat parts such as struts, hydrofoils, photovoltaic panels, and many others.",
    "The furnace has been operating reliably since its completion in January 2023.",
    "Future work could include creating a MATLAB model of the furnace and optimizing the controller design.",
    "Additionally, migrating from Arduino to a more capable microcontroller such as ESP or Raspberry Pi would be beneficial."
  ],

  "images": [
    {
      "src": "../images/composite_heater_and_controller/controller_pcb_prototype.jpg",
      "caption": "Figure 1: Assembled prototype of the controller PCB backside; solid-state relays (SSRs) visible in the background"
    },
    {
      "src": "../images/composite_heater_and_controller/TODO.jpg",
      "caption": "Figure 2: User interface with display and control buttons (photo pending replacement)"
    }
  ]
}